Autodesk.Revit.DB.Analysis.ConceptualConstructionRoofType
ConceptualConstructionType values for Roofs.
Since:
2012
Since:
2012

Autodesk.Revit.DB.Analysis.ConceptualConstructionRoofType.NumRoofTypeConstruction
Total Number of Roof Type Constructions

Autodesk.Revit.DB.Analysis.ConceptualConstructionRoofType.NoInsulationDarkRoof
No Insulation Dark Roof

Autodesk.Revit.DB.Analysis.ConceptualConstructionRoofType.LowInsulationDarkRoof
Low Insulation Dark Roof

Autodesk.Revit.DB.Analysis.ConceptualConstructionRoofType.LowInsulationCoolRoof
Low Insulation Cool Roof

Autodesk.Revit.DB.Analysis.ConceptualConstructionRoofType.TypicalInsulationDarkRoof
Typical Insulation Dark Roof

Autodesk.Revit.DB.Analysis.ConceptualConstructionRoofType.TypicalInsulationCoolRoof
Typical Insulation Cool Roof

Autodesk.Revit.DB.Analysis.ConceptualConstructionRoofType.HighInsulationDarkRoof
High Insulation Dark Roof

Autodesk.Revit.DB.Analysis.ConceptualConstructionRoofType.HighInsulationCoolRoof
High Insulation Cool Roof

Autodesk.Revit.DB.Analysis.ConceptualConstructionRoofType.InvalidRoofTypeConstruction
Invalid value/not set Roof Type Construction value